---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextElement
source: html/8bcc2fb5-66b3-1fe8-2f09-4a9a4398c4ce.htm
---
# TextElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.